example/cylinder_shedding/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    inlet
    {
        type            wall;
        inGroups        1(wall);
        nFaces          60;
        startFace       131620;
    }
    outlet
    {
        type            wall;
        inGroups        1(wall);
        nFaces          100;
        startFace       131680;
    }
    top
    {
        type            wall;
        inGroups        1(wall);
        nFaces          160;
        startFace       131780;
    }
    bottom
    {
        type            wall;
        inGroups        1(wall);
        nFaces          160;
        startFace       131940;
    }
    cylinder
    {
        type            wall;
        inGroups        1(wall);
        nFaces          280;
        startFace       132100;
    }
    sides
    {
        type            empty;
        inGroups        1(empty);
        nFaces          132000;
        startFace       132380;
    }
)

// ************************************************************************* //
